configuration/src/InformationRegisters/ИзбранныеИнструментыПользователей/ИзбранныеИнструментыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранныеИнструментыПользователей</name>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>CatalogRef.ИнструментыСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоОтчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ИнструментыСистемы/ИнструментыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнструментыСистемы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Добавить</name>
      <description>Добавить</description>
    </items>
    <items>
      <name>Закрепленные</name>
      <description>Закрепленные</description>
    </items>
    <items>
      <name>Контроль</name>
      <description>Контроль</description>
    </items>
    <items>
      <name>Мои</name>
      <description>Мои</description>
    </items>
    <items>
      <name>МоиНастройки</name>
      <description>Мои настройки</description>
    </items>
    <items>
      <name>НастройкаПроцессаФилиала</name>
      <description>Настройка процесса филиала</description>
    </items>
    <items>
      <name>Отчеты</name>
      <description>Отчеты</description>
    </items>
    <items>
      <name>Планирование</name>
      <description>Планирование</description>
    </items>
    <items>
      <name>Прочие</name>
      <description>Прочие</description>
    </items>
    <items>
      <name>СпискиДокументов</name>
      <description>Списки документов</description>
    </items>
    <items>
      <name>Трудозатраты</name>
      <description>Трудозатраты</description>
    </items>
    <items>
      <name>Управление</name>
      <description>Управление</description>
    </items>
    <items>
      <name>УправлениеУслугами</name>
      <description>Управление услугами</description>
    </items>
  </predefined>
  <attributes>
    <name>БыстрыйДоступ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСчетчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Иконка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляБыстрогоДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОпределенияДоступности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/CommonModules/ИнструментыВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ЗапуститьФоновоеЗадание(Знач ИмяМетода, Знач Параметры, Знач Ключ) Экспорт
	
	РезультатЗапуска = ОбщегоНазначения.СоздатьФоновоеЗадание(ИмяМетода, Параметры, ИмяМетода, Ключ);
	Возврат ЗначениеЗаполнено(РезультатЗапуска.Идентификатор);
	
КонецФункции

Процедура ОбработатьСообщениеСайта(Знач Данные) Экспорт
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если Данные.event = "favoriteChange" Тогда
		Инструмент = Справочники.ИнструментыСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.id));
		ДобавлениеИзбранного = Данные.favoriteAdding;
		ЭтоОтчет = Данные.report;
		
		НаборЗаписей = РегистрыСведений.ИзбранныеИнструментыПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);
		НаборЗаписей.Отбор.ЭтоОтчет.Установить(ЭтоОтчет);
		
		НаборЗаписей.Прочитать();
		
		Если ДобавлениеИзбранного Тогда
			Порядок = НаборЗаписей.Количество();
			
			НаборЗаписей.Очистить();
			НаборЗаписей.Отбор.Инструмент.Установить(Инструмент);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Пользователь = ТекущийПользователь;
			НоваяЗапись.Инструмент = Инструмент;
			НоваяЗапись.ЭтоОтчет = ЭтоОтчет;
			НоваяЗапись.Порядок = Порядок;
			
		Иначе
			ИзбранноеПользователя = НаборЗаписей.Выгрузить();
			Строка = ИзбранноеПользователя.Найти(Инструмент, "Инструмент");
			
			Если Строка <> Неопределено Тогда
				ИзбранноеПользователя.Удалить(Строка);
				ИзбранноеПользователя.Сортировать("Порядок");
				
				Порядок = 0;
				
				Для Каждого Строка Из ИзбранноеПользователя Цикл
					Строка.Порядок = Порядок;
					Порядок = Порядок + 1;
				КонецЦикла;
				
				НаборЗаписей.Загрузить(ИзбранноеПользователя);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
	ИначеЕсли Данные.event = "favoriteReportsChange" Тогда
		НаборЗаписей = РегистрыСведений.ИзбранныеИнструментыПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);
		НаборЗаписей.Отбор.ЭтоОтчет.Установить(Истина);
		
		Порядок = 0;
		Для Каждого ИзбранныйОтчет Из Данные.favoriteReports Цикл
			Инструмент = Справочники.ИнструментыСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор(ИзбранныйОтчет));
			
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Пользователь = ТекущийПользователь;
			НоваяСтрока.ЭтоОтчет = Истина;
			НоваяСтрока.Инструмент = Инструмент;
			НоваяСтрока.Порядок = Порядок;
			
			Порядок = Порядок + 1;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	ИначеЕсли Данные.event = "favoriteOnUpdateOrder" Тогда
		Инструмент = Справочники.ИнструментыСистемы.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.id));
		ЭтоОтчет = Данные.report;
		Сдвиг = Данные.newIndex - Данные.oldIndex;
		
		НаборЗаписей = РегистрыСведений.ИзбранныеИнструментыПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);
		НаборЗаписей.Отбор.ЭтоОтчет.Установить(ЭтоОтчет);
		
		НаборЗаписей.Прочитать();
		ИзбранноеПользователя = НаборЗаписей.Выгрузить();
		Строка = ИзбранноеПользователя.Найти(Инструмент, "Инструмент");
		
		Если Строка <> Неопределено Тогда
			ИзбранноеПользователя.Сортировать("Порядок");
			ИзбранноеПользователя.Сдвинуть(Строка, Сдвиг);
			
			Порядок = 0;
			
			Для Каждого Строка Из ИзбранноеПользователя Цикл
				Строка.Порядок = Порядок;
				Порядок = Порядок + 1;
			КонецЦикла;
			
			НаборЗаписей.Загрузить(ИзбранноеПользователя);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
